Revit 2027 API
ElementLogicalFilter Class
 A filter used to logically combine two or more filters.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementLogicalFilter
 Autodesk.Revit.DB.LogicalAndFilter
 Autodesk.Revit.DB.LogicalOrFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementLogicalFilter : ElementFilter
Public Class ElementLogicalFilter
	Inherits ElementFilter
public ref class ElementLogicalFilter : public ElementFilter
type ElementLogicalFilter =
    class
        inherit ElementFilter
    end
The ElementLogicalFilter type exposes the following members.
Properties
Name | Description
Inverted |  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
(Inherited from ElementFilter)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ElementFilter)
Top
Methods
Name | Description
Dispose
(Inherited from ElementFilter)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFilters |  Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
PassesFilter(Element) |  Applies the filter to a given element.
(Inherited from ElementFilter)
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
(Inherited from ElementFilter)
SetFilters |  Replaces current filters in the logical filter with any number of input filters.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.
See Also
Reference
Autodesk.Revit.DB Namespace